Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་དོང་སྟེ་ལྷགས་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: Upon their arrival, they bowed low until their foreheads touched the Blessed One’s feet, and then they sat down to one side.

source: །ཕྱོགས་གཅིག་ཏུ་འཁོད་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བང་མཛོད་སྟུག་པོ་ཅན་གྱི་བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་ལ་ཆོས་དང་ལྡན་པའི་གཏམ་གྱིས་ཡང་དག་པར་སྟོན་པར་མཛད། ཡང་དག་པར་འཛིན་དུ་འཇུག་པར་མཛད། ཡང་དག་པར་གཟེངས་སྟོད་པར་མཛད། ཡང་དག་པར་རབ་ཏུ་དགའ་བར་མཛད་དོ།། །།འདུལ་བ་གཞི།
en: When they had sat down to one side, the Blessed One, through talk consistent with the Dharma, instructed, inspired, encouraged, and delighted the brahmins and householders in Sthūlakoṣṭhaka.

source: བམ་པོ་སུམ་བཅུ་རྩ་བཞི་པ། དེའི་ཚེ་ཁྱིམ་བདག་གི་བུ་ཡུལ་འཁོར་སྐྱོང་འཁོར་དེ་ཉིད་དུ་འདུས་ཤིང་འདུག་པར་གྱུར་ཏོ། །དེ་ནས་ཁྱིམ་བདག་གི་བུ་ཡུལ་འཁོར་སྐྱོང་འདི་སྙམ་དུ་སེམས་ཏེ།
en: At that time, a householder’s son named Rāṣṭrapāla was sitting in the assembly.

source: ཇི་ལྟར་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པའི་དོན་བདག་གིས་ཤེས་པ་ལྟར་ན་ཁྱིམ་པ་ཁྱིམ་ན་གནས་པས་ཇི་སྲིད་འཚོའི་བར་དུ་ཚངས་པར་སྤྱོད་པ་གཅིག་ཏུ་སལ་གྱིས་དག་པ། མ་འདྲེས་པ། ཡོངས་སུ་རྫོགས་པ།
en: Rāṣṭrapāla, the son of a householder, thought, “If I correctly understand the meaning of what the Blessed One has said, it is difficult for laymen, who live at home, to lead the pure life, which is totally pure, unmixed, complete, completely pure, and clean, throughout their lives.

source: ཡོངས་སུ་དག་པ། རྣམ་པར་བྱང་བ་སྤྱད་པ་འདི་ནི་སླ་བ་མ་ཡིན་པས་མ་ལ་བདག་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ཏེ་གོས་ངུར་སྨྲིག་བགོས་ནས་དད་པ་ཡང་དག་པ་ཁོ་ནས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་འབྱུང་ངོ་སྙམ་མོ།
en: Now I will go forth from my home into homelessness with true faith, having shaved off my hair and beard and donned saffron robes.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྣམ་གྲངས་དུ་མར་བང་མཛོད་སྟུག་པོ་ཅན་གྱི་བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་ལ་ཆོས་དང་ལྡན་པའི་གཏམ་གྱིས་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་བསྟོད། ཡང་དག་པར་རབ་ཏུ་དགའ་བར་མཛད་ནས་ཅང་མི་གསུང་ངོ་།
en: After the Blessed One had instructed, inspired, encouraged, and delighted the brahmins and householders in Sthūlakoṣṭhaka in a variety of ways through talk consistent with the Dharma, he remained silent.

source: །དེ་ནས་བང་མཛོད་སྟུག་པོ་ཅན་གྱི་བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་དགའ་སྟེ་ཡི་རངས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔ་ནས་དོང་ངོ་།
en: The brahmins and householders in Sthūlakoṣṭhaka then rejoiced in and praised the words of the Blessed One. They bowed low until their foreheads touched the Blessed One’s feet, and then departed from the Blessed One’s presence.

source: །ཁྱིམ་བདག་གི་བུ་ཡུལ་འཁོར་སྐྱོང་གིས་བང་མཛོད་སྟུག་པོ་ཅན་གྱི་བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་དོང་ནས་རིང་པོ་མ་ལོན་པར་རིག་ནས་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བདག་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་འབྱུང་བ་དང་། བསྙེན་པར་རྫོགས་པ་དགེ་སློང་གི་དངོས་པོ་འཐོབ་པ་ལྟ་ན།
en: As soon as the brahmins and householders in Sthūlakoṣṭhaka had departed, Rāṣṭrapāla, the son of a householder, rose from his seat, draped his upper robe over one shoulder, made the gesture of supplication to the Blessed One, and said to him, “O Honored One, I wish to go forth and be ordained a monk in the well-taught Dharma and Vinaya.

source: །ཁྱིམ་བདག་གི་བུ་ཕ་དང་མ་གཉིས་ཀྱིས་གནང་ངམ།
en: “O son of a householder, have your parents permitted it?”

source: བཙུན་པ་མ་གནང་ངོ་།
en: “No, they have not, O Honored One.”

source: །ཁྱིམ་བདག་གི་བུ་དེ་བཞིན་གཤེགས་པའམ། དེ་བཞིན་གཤེགས་པའི་ཉན་ཐོས་རྣམས་ནི་ཕ་དང་མ་གཉིས་ཀྱིས་མ་གནང་བ་རབ་ཏུ་འབྱིན་པ་དང་། བསྙེན་པར་རྫོགས་པར་མི་བྱེད་དོ།
en: “O son of a householder, the Tathāgata and the disciples of the Tathāgata neither let anyone go forth nor ordain him while he does not have his parents’ permission.”

source: །བཙུན་པ་བདག་གིས་ཅི་ནས་ཕ་དང་མས་གནང་བ་དེ་ལྟར་བགྱི་ལགས་སོ།
en: “In that case, O Honored One, I will try to gain permission from my parents.”

source: །དེ་ནས་ཁྱིམ་བདག་གི་བུ་ཡུལ་འཁོར་སྐྱོང་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་དགའ་སྟེ་ཡི་རངས་ནས། རང་གི་ཁྱིམ་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་། ཕ་དང་མ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then Rāṣṭrapāla, the son of a householder, praised and was delighted at the words of the Blessed One and went home.

source: །ཡབ་ཡུམ་མཁྱེན་པར་མཛོད་ཅིག །བདག་དད་པ་ཡང་དག་པ་ཁོ་ནས་ཁྱིམ་ནས་ཁྱིམ་མ་མཆིས་པར་རབ་ཏུ་འབྱུང་བར་བགྱིའོ།
en: When he had arrived, he said to his parents, “Father, Mother, please be informed that I will go forth from my home into homelessness with true faith.” “Our son Rāṣṭrapāla, understand this:

source: །བུ་ཡུལ་འཁོར་སྐྱོང་ཤེས་པར་གྱིས་ཤིག །ཁྱོད་ངེད་ཀྱི་བུ་གཅིག་པ་སྡུག་པ་ཡིད་དུ་འོང་བ་བཟོད་པ་མི་མཐུན་པ་མེད་པ་ཡིན་པས་ཁྱོད་ཤི་བར་གྱུར་ན་ངེད་མི་འདོད་བཞིན་དུ་འབྲལ་གྲང་།
en: You are our only, dear, sweet, darling son, who has never disobeyed us. If you die, we will have to part from you unwillingly.

source: གསོན་བཞིན་དུ་ག་ལ་གཏང་།
en: But where would we let you go while you are still alive?”

source: ཡབ་ཡུམ་གལ་ཏེ་རེ་ཞིག་གནང་ན་ལེགས།
en: “Father, Mother, if you permit this right now, that’s fine.

source: གལ་ཏེ་མ་གནང་ན་དེང་སླན་ཅད་འཚལ་མ་ཡང་མི་འཚལ། ཕྱག་ཡང་མི་འཚལ་ལོ།
en: But if you do not permit this, I will neither have a meal nor pay obeisance to you from today onward.”

source: །དེ་ནས་ཁྱིམ་བདག་གི་བུ་ཡུལ་འཁོར་སྐྱོང་གིས་ཉི་མ་གཅིག་ཀྱང་ཟན་བཅད་པ་བྱས་སོ།
en: Then Rāṣṭrapāla, the son of a householder, fasted for a day.

source: །གཉིས་དང་གསུམ་ནས་བདུན་གྱི་བར་དུ་ཟན་བཅད་པ་བྱས་སོ།
en: After that, he fasted for two days, for three days—all the way to seven days.

source: །དེ་ནས་ཁྱིམ་བདག་གི་བུ་ཡུལ་འཁོར་སྐྱོང་གི་ཕ་དང་མས་ཁྱིམ་བདག་གི་བུ་ཡུལ་འཁོར་སྐྱོང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then the parents of Rāṣṭrapāla said to him, “Our son Rāṣṭrapāla, understand this:

source: །བུ་ཡུལ་འཁོར་སྐྱོང་ཤེས་པར་གྱིས་ཤིག །ཁྱོད་ནི་ཤིན་ཏུ་གཞོན་པ་བདེ་བ་འདོད་པ་ཡིན་པས་ཁྱོད་ཀྱི་སྡུག་བསྔལ་མི་ཤེས་ཏེ།
en: You are delicate, you desire comfort, and you have not known pain.

source: ཚངས་པར་སྤྱོད་པ་སྤྱད་དཀའོ། །རབ་ཏུ་དབེན་པ་བྱ་དཀའོ། །གཅིག་པུ་ཉིད་ལ་མངོན་པར་དགའ་བ་དཀའོ། །གནས་མལ་དགོན་པ་དང་། ནགས་ཁྲོད་དང་། བས་མཐར་གནས་པ་ནི་མནགས་དཀའོ།
en: It is difficult to lead the pure life, it is difficult to practice in complete seclusion, it is difficult to rejoice in solitude, and it is unbearable to live in a dwelling in the wilderness, in a forest, or on the outskirts of a town.

source: །བུ་ཡུལ་འཁོར་སྐྱོང་ཚུར་འདུག་ལ་འདོད་པ་དག་ལ་ཡང་སྤྱོད་ཅིག །སྦྱིན་པ་དག་ཀྱང་བྱིན་ཅིག །བསོད་ནམས་དག་ཀྱང་གྱིས་ཤིག །དེ་སྐད་སྨྲས་ན་ཁྱིམ་བདག་གི་བུ་ཡུལ་འཁོར་སྐྱོང་ཅང་མི་སྨྲའོ།
en: Stay here, our son Rāṣṭrapāla, and enjoy the objects of desire, give donations, and make merit.” Even when told this, Rāṣṭrapāla, the son of a householder, remained silent.

source: །དེ་ནས་ཁྱིམ་བདག་གི་བུ་ཡུལ་འཁོར་སྐྱོང་གི་ཕ་དང་མས་ཉེ་དུ་རྣམས་ལ་བཅོལ་བ།
en: The parents of Rāṣṭrapāla then asked their relatives for help:

source: ཀྱེ་ཉེ་དུ་དག་རེ་ཞིག་བུ་ཡུལ་འཁོར་སྐྱོང་སློང་ཤིག །དེ་ནས་ཁྱིམ་བདག་གི་བུ་ཡུལ་འཁོར་སྐྱོང་གི་ཉེ་དུ་རྣམས་ཁྱིམ་བདག་གི་བུ་ཡུལ་འཁོར་སྐྱོང་གང་ན་བ་དེར་དོང་སྟེ་ཕྱིན་ནས། ཁྱིམ་བདག་གི་བུ་ཡུལ་སྐྱོང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “O relatives, make our son Rāṣṭrapāla come to his senses at once.” Then the relatives of Rāṣṭrapāla, the son of a householder, went to Rāṣṭrapāla.

source: །བུ་ཡུལ་འཁོར་སྐྱོང་མཁྱེན་པར་མཛོད་ཅིག །ཁྱོད་ནི་ཤིན་ཏུ་གཞོན་པས་བདེ་བ་བཞེད་པ་ལགས་ཞེས་བྱ་བ་ནས་བསོད་ནམས་དག་གྱིས་ཤིག་ཅེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: When they had arrived, they said to him, “Son Rāṣṭrapāla, understand this: You are delicate; you desire comfort . . . , and make merit.”

source: །དེ་སྐད་སྨྲས་ན་ཁྱིམ་བདག་གི་བུ་ཡུལ་འཁོར་སྐྱོང་ཅང་མི་སྨྲའོ།
en: Even when told this, Rāṣṭrapāla, the son of a householder, remained silent.

source: །དེ་ནས་ཁྱིམ་བདག་གི་བུ་ཡུལ་འཁོར་སྐྱོང་གི་ཕ་དང་མས་ཡུལ་འཁོར་སྐྱོང་གི་ནེའུ་ལྡངས་རྣམས་ལ་བཅོལ་བ།
en: Then the parents of Rāṣṭrapāla asked Rāṣṭrapāla’s friends for help:

source: ཀྱེ་གཞོན་ནུ་དག་རེ་ཞིག་བུ་ཡུལ་འཁོར་སྐྱོང་སློང་ཤིག །དེ་ནས་ཁྱིམ་བདག་གི་བུ་ཡུལ་འཁོར་སྐྱོང་གི་ནེའུ་ལྡངས་རྣམས་ཀྱིས་ཡུལ་འཁོར་སྐྱོང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཀྱེ་སྲས་དེས་པ་ཡུལ་འཁོར་སྐྱོང་མཁྱེན་པར་མཛོད་ཅིག །ཁྱོད་ནི་ཤིན་ཏུ་གཞོན་པས་བདེ་བ་བཞེད་པ་ལགས་ལ་ཞེས་བྱ་བ་ནས།
en: “O sons, make our son Rāṣṭrapāla come to his senses at once.” Then the friends of Rāṣṭrapāla, the son of a householder, said to Rāṣṭrapāla, “Good son Rāṣṭrapāla, understand this: You are delicate;

source: བསོད་ནམས་དག་མཛོད་ཅིག་ཅེས་བྱ་བའི་བར་སྔ་མ་བཞིན་དུའོ།
en: you desire comfort . . . , and make merit.”

source: །དེས་དེ་སྐད་སྨྲས་ན་ཁྱིམ་བདག་གི་བུ་ཡུལ་འཁོར་སྐྱོང་ཅང་མི་སྨྲའོ།
en: Even when told this, Rāṣṭrapāla, the son of a householder, remained silent.

source: །དེ་ནས་གཞོན་ནུ་དག་གིས་ཡུལ་འཁོར་སྐྱོང་གི་ཕ་དང་མ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཡབ་ཡུམ་སྲས་ཡུལ་འཁོར་སྐྱོང་འདི་གུམ་པས་ཅི་ཞིག་བགྱི།
en: Then the friends said to the parents of Rāṣṭrapāla, “Father and mother, what use is there in letting this son Rāṣṭrapāla die?

source: རབ་ཏུ་འབྱུང་དུ་གནོང་དང་། གལ་ཏེ་དགའ་བར་གྱུར་ན་འདི་གསོན་པོ་ཉིད་དུ་གཟིགས་པར་འགྱུར་ལ།
en: Permit him to go forth. Then, if he rejoices in the pure life, you will be able to see him alive;

source: གལ་ཏེ་མངོན་པར་མི་དགའ་བར་གྱུར་ན་ཡང་བུའི་གནས་ཕ་མ་གཉིས་མ་ལགས་པ་གཞན་སུ་ཞིག་མཆིས།
en: if he does not rejoice in it, to whom will the son go but to his parents?”

source: གཞོན་ནུ་དག་བདག་ཅག་ལ་གལ་ཏེ་རབ་ཏུ་བྱུང་ནས་ལྟ་བར་བྱེད་ན་དེ་བཞིན་དུ་གནང་བར་བྱའོ།
en: “Sons, if he lets us see him after he has gone forth, we will permit this.”

source: །དེ་ནས་ཡུལ་འཁོར་སྐྱོང་གི་ནེའུ་ལྡངས་དག་གིས་ཁྱིམ་བདག་གི་བུ་ཡུལ་འཁོར་སྐྱོང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ་།
en: Then the friends said to Rāṣṭrapāla, the son of a householder, “Good son Rāṣṭrapāla, be informed that your parents permit this.

source: །དེས་པ་ཡུལ་འཁོར་སྐྱོང་མཁྱེན་པར་མཛོད་ཅིག །ཕ་དང་མས་གནང་སྟེ་འདི་སྐད་ཅེས་གལ་ཏེ་རབ་ཏུ་བྱུང་ནས་ལྟ་བར་བྱེད་ནའོ་ཞེས་ཀྱང་ཟེར་རོ།
en: They say, ‘If our son lets us see him after he has gone forth.’ ”

source: །ཤེས་ལྡན་དག་བལྟ་བར་བྱའོ།
en: “Sirs, I will let them see me.”

source: །དེ་ནས་ཁྱིམ་བདག་གི་བུ་ཡུལ་འཁོར་སྐྱོང་རིམ་གྱིས་ལུས་ཀྱི་མཐུ་དང་སྟོབས་བསྐྱེད་ནས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: Thereafter Rāṣṭrapāla, the son of a householder, having gradually recovered his bodily strength and power, went to the Blessed One. When he had arrived, he bowed low until his forehead touched the Blessed One’s feet, and then he sat down to one side.

source: །ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་བཅོམ་ལྡན་འདས་ལ་ཁྱིམ་བདག་གི་བུ་ཡུལ་འཁོར་སྐྱོང་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བདག་ནི་ཕ་དང་མས་གནང་ལགས་ཀྱིས།
en: When he had sat down to one side, Rāṣṭrapāla, the son of a householder, said to the Blessed One, “O Honored One, I was given permission by my parents.

source: བཙུན་པ་བདག་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་འབྱུང་བ་དང་བསྙེན་པར་རྫོགས་པ་དགེ་སློང་གི་དངོས་པོ་འཐོབ་པ་ལྟ་ན།
en: Therefore, O Honored One, I wish to go forth and be ordained a monk in the well-taught Dharma and Vinaya.

source: །ཁྱིམ་བདག་གི་བུ་ཡུལ་འཁོར་སྐྱོང་གིས་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་འབྱུང་བ་དང་བསྙེན་པར་རྫོགས་པ་དགེ་སློང་གི་དངོས་པོ་ཐོབ་པར་གྱུར་ཏོ།
en: Rāṣṭrapāla, the son of a householder, went forth and was ordained a monk in the well-taught Dharma and Vinaya.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱིམ་བདག་གི་བུ་ཡུལ་འཁོར་སྐྱོང་རབ་ཏུ་ཕྱུང་བསྙེན་པར་རྫོགས་པར་མཛད་ནས་བང་མཛོད་སྟུག་པོ་ཅན་དུ་ཇི་ཙམ་བཞེད་ཀྱི་བར་དུ་བཞུགས་ནས་མཉན་ཡོད་གང་ན་བ་དེར་རྒྱུ་ཞིང་གཤེགས་ཏེ།
en: Then the Blessed One, having let Rāṣṭrapāla, the son of a householder, go forth and ordained him, and having stayed in Sthūlakoṣṭhaka as long as he wished, traveled to Śrāvastī.

source: རིམ་གྱིས་རྒྱུ་ཞིང་གཤེགས་པ་དང་མཉན་ཡོད་དུ་བྱོན་ནས་མཉན་ཡོད་ན་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ན་བཞུགས་སོ།
en: In due course he arrived at Śrāvastī and stayed in the Jetavana, in the Park of Anāthapiṇḍada near Śrāvastī.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་བསྙེན་པར་རྫོགས་ཏེ་ལོ་བཅུ་ལོན་ནས་དགྲ་བཅོམ་པ་ཐོབ་སྟེ་རྣམ་པར་གྲོལ་བའི་དགའ་བ་དང་བདེ་བ་ཉམས་སུ་མྱོང་ནས་འདི་སྙམ་དུ་སེམས་ཏེ། སྔོན་བདག་ཁྱིམ་པར་གྱུར་པ་ན་ཕ་དང་མ་ལ་རབ་ཏུ་བྱུང་ནས་བལྟ་བར་བྱའོ་ཞེས་ཁས་བླངས་པ་ཡོད་ཀྱིས།
en: Ten years after his ordination, the venerable Rāṣṭrapāla attained the state of an arhat. Having savored the joy and happiness of liberation, he thought, “Once when I was a layman, I promised my parents to see them after I had gone forth.

source: མ་ལ་བདག་གིས་ཁས་བླངས་པ་དེ་མཐར་དབྱུང་ངོ་སྙམ་ནས།
en: Now I will carry out my promise.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: The venerable Rāṣṭrapāla then went to the Blessed One. Upon his arrival, he bowed low until his forehead touched the Blessed One’s feet, and then he sat down to one side.

source: །ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་སྔོན་བདག་ཁྱིམ་པར་གྱུར་པ་ན་ཕ་དང་མ་ལ་བལྟ་བར་བགྱིའོ་ཞེས་གཡར་གྱིས་བླངས་པས་བདག་གཡར་གྱིས་བླངས་པ་དེ་མཐར་འབྱིན་དུ་མཆིའོ།
en: When he had sat down to one side, the venerable Rāṣṭrapāla said to the Blessed One, “O Honored One, once when I was a layman, I promised my parents I would see them. Now I will go to carry out my promise.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཐུགས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་གི་སེམས་ཁྱབ་པར་མཛད་ཅིང་ཁྱབ་པར་མཛད་ནས་ཐུགས་ལ་མཛད་ཅིང་།
en: Then the Blessed One made his mind penetrate the mind of the venerable Rāṣṭrapāla.

source: ཐུགས་ལ་མཛད་ནས་འདི་སྙམ་དུ་དགོངས་ཏེ། རིགས་ཀྱི་བུ་ཡུལ་འཁོར་སྐྱོང་ནི་སླར་ཡང་ཁྱིམ་ན་གནས་པའམ། སོགས་འཇོག་སྤྱོད་པས་འདོད་པ་དག་ལ་ལོངས་སྤྱོད་པའི་འོས་མ་ཡིན་ནོ་སྙམ་དུ་མཁྱེན་ནས། ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: When it had penetrated it, he concentrated his mind on the mind of the venerable Rāṣṭrapāla, and then he thought, “It is impossible that Rāṣṭrapāla, the son of a noble family, will dwell at home again or enjoy the objects of desire by hoarding,” and so he said to the venerable Rāṣṭrapāla, “Rāṣṭrapāla, go and liberate beings who have not been liberated.

source: །ཡུལ་འཁོར་སྐྱོང་ཁྱོད་སོང་ལ་སེམས་ཅན་མ་རྒལ་བ་རྣམས་ནི་སྒྲོལ་ཅིག །མ་གྲོལ་བ་རྣམས་ནི་གྲོལ་བར་གྱིས་ཤིག །དབུགས་མ་ཕྱིན་པ་རྣམས་ནི་དབུགས་ཕྱུང་ཤིག །ཡོངས་སུ་མྱ་ངན་ལས་མ་འདས་པ་རྣམས་ནི་ཡོངས་སུ་མྱ་ངན་ལས་ཟློས་ཤིག །དེ་ནས་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་དགའ་སྟེ་ཡི་རངས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔ་ནས་སོང་ངོ་།
en: Release those who have not been released. Relieve those who have not been relieved. Emancipate those who have not been emancipated.” The venerable Rāṣṭrapāla then praised and delighted in the words of the Blessed One. The venerable Rāṣṭrapāla bowed low until his forehead touched the Blessed One’s feet, and he then departed from the Blessed One’s presence.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་དེ་ཉིད་ཀྱི་མཚན་མོ་འདས་ནས་སྔ་དྲོ་ཤམ་ཐབས་བགོས་ལྷུང་བཟེད་དང་ཆོས་གོས་ཐོགས་ཏེ་མཉན་ཡོད་དུ་བསོད་སྙོམས་ལ་ཞུགས་ཏེ།
en: After that night had passed, the venerable Rāṣṭrapāla dressed early in the morning, took his bowl and his robe, and entered Śrāvastī for alms.

source: མཉན་ཡོད་དུ་བསོད་སྙོམས་སྤྱད་ནས་ཟས་ཀྱི་བྱ་བ་བྱས་ཏེ་ཟས་ཕྱི་མའི་བསོད་སྙོམས་ལས་སླར་ལོག་ནས་གནས་མལ་ཇི་ལྟར་སྤྱད་པ་མཁོས་སུ་ཕབ་སྟེ་ལྷུང་བཟེད་དང་ཆོས་གོས་བླངས་ནས་བང་མཛོད་སྟུག་པོ་ཅན་གང་ན་བ་དེར་སོང་སྟེ།
en: He took a meal of alms in Śrāvastī and returned after the meal. He put in order the bedding and the seat he had used and set out for Sthūlakoṣṭhaka.

source: རིམ་གྱིས་སྤྱད་པ་སྤྱོད་ཅིང་རྒྱུ་བ་ན་བང་མཛོད་སྟུག་པོ་ཅན་དུ་ཕྱིན་ནས། བང་མཛོད་སྟུག་པོ་ཅན་གྱི་བང་མཛོད་སྟུག་པོའི་ཚལ་དུ་འདུག་གོ།
en: As he traveled, in due course he arrived at Sthūlakoṣṭhaka and stayed in Sthūlakoṣṭhaka Forest near Sthūlakoṣṭhaka.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་དེ་ཉིད་ཀྱི་མཚན་མོ་འདས་ནས་སྔ་དྲོ་ཤམ་ཐབས་བགོས། ལྷུང་བཟེད་དང་ཆོས་གོས་ཐོགས་ཏེ་བང་མཛོད་སྟུག་པོ་ཅན་དུ་བསོད་སྙོམས་ལ་ཞུགས་ནས།
en: Thereupon the venerable Rāṣṭrapāla, after that next night had passed, dressed early in the morning, took his bowl and his robe, and entered Sthūlakoṣṭhaka for alms.

source: དེ་རིམ་གྱིས་བང་མཛོད་སྟུག་པོ་ཅན་ནས་བསོད་སྙོམས་ལ་རྒྱུ་བ་ན་རང་གི་ཁྱིམ་གང་ན་དེར་སོང་ནས།
en: Going for alms in Sthūlakoṣṭhaka, in due course he went to his own home.

source: དེའི་ཚེ་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་གི་ཕ་བར་སྒོའི་ཁྱམས་ན་སྐྱེས་པ་སྐྲ་མཁན་གྱིས་སྐྲ་དང་ཁ་སྤུ་འཆོས་པ་ན། ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་གི་ཕས་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་སྒོ་དྲུང་ན་འདུག་པ་མཐོང་ངོ་།
en: At that time, a barber was arranging the hair and beard of the venerable Rāṣṭrapāla’s father in the courtyard, and his father saw the venerable Rāṣṭrapāla standing before the gate.

source: །མཐོང་ནས་ཀྱང་ཁ་ཟེར་བར་བྱེད་དེ།
en: When he saw him, the father scolded him:

source: དགེ་སྦྱོང་མགོ་རེག་འོ་ནི་དག་གིས་ཁོ་བོའི་རིགས་ཀྱི་རྒྱུན་བཅད་དེ།
en: “You shaven-headed śramaṇa, you have destroyed my family line.

source: འོ་ནི་དག་གིས་ཁོ་བོའི་བུ་གཅིག་པ་སྡུག་པ་ཡིད་དུ་འོང་བ་བཟོད་པ་མི་མཐུན་པ་མེད་པ་ཡུལ་འཁོར་སྐྱོང་རབ་ཏུ་ཕྱུང་བསྙེན་པར་རྫོགས་པར་བྱས་ན།
en: You made Rāṣṭrapāla, my only, dear, sweet, darling son, who had never disobeyed me, go forth and then ordained him.

source: དགེ་སྦྱོང་མགོ་རེག་འོ་ནི་རྣམས་ལ་སུ་ཞིག་བསོད་སྙོམས་སྦྱིན་པར་བྱ་བར་སེམས།
en: You shaven-headed śramaṇa, who is going to give you almsfood?”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་གིས་རང་གི་ཁྱིམ་ནས་རྒྱ་གག་མ་གཏོགས་པ་སྦྱིན་པ་ཡང་མ་ཐོབ། བསྐྲད་ཀྱང་མ་བསྐྲད་པ་དང་མྱུར་བ་མྱུར་བར་ཕྱིར་བྱུང་ངོ་།
en: Then the venerable Rāṣṭrapāla, having gotten no offering but abuse, left his own home before he was chased away.

source: །དེའི་ཚེ་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་གི་སྔོན་གྱི་བྲན་མོ་རྒན་མོ་ཞིག་ཟན་དྲོན་རུལ་པ་ཞག་ལོན་པ་ཞིག་དོར་བའི་ཕྱིར་ཐོགས་ཏེ་སྒོར་བྱུང་བ་དང་། ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་གིས་སྔོན་གྱི་བྲན་མོ་རྒན་མོ་དེ་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་བྲན་མོ་རྒན་མོ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: At that time an old woman, who had once been a slave of the venerable Rāṣṭrapāla, came out the door, carrying spoiled, day-old kulmāṣa in order to throw it away. When the venerable Rāṣṭrapāla saw the old woman, his former slave, he said to her, “Sister, if you are throwing away that spoiled, day-old kulmāṣa, I will eat it. Please put it in this bowl.”

source: །སྲིང་མོ་གལ་ཏེ་ཟན་དྲོན་རུལ་པ་ཞག་ལོན་པ་འདོར་བ་ཡིན་ན་ཁོ་བོས་བཟས་ལྷུང་བཟེད་འདིར་ཆུག་ཤིག །འཕགས་པ་གསོལ་ཅིག །དེ་ནས་སྔོན་གྱི་བྲན་མོ་རྒན་མོ་དེས་ཟན་དྲོན་རུལ་པ་ཞིག་ལོན་པ་ལྷུང་བཟེད་དུ་འཇུག་པ་ན་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་གི་ལག་པ་དང་། རྐང་པ་དང་། བཞིན་དང་། སྣ་དང་། སྨྲ་དངགས་དག་གི་མཚན་མ་ཤིན་ཏུ་ལེགས་པར་བཟུང་ནས་འདི་སྐད་ཅེས་ཀྱང་སྨྲས་སོ།
en: “O noble one, please have it.” Putting the spoiled, day-old kulmāṣa in the bowl, the old woman, his former slave, then recognized the characteristics of the hands, feet, face, nose, and way of speaking of the venerable Rāṣṭrapāla.

source: །རྗེའི་སྲས་ཡུལ་འཁོར་སྐྱོང་ལགས་སམ།
en: She asked, “Sir, are you Rāṣṭrapāla?”

source: སྲིང་མོ་ཁོ་བོ་སྐྱེ་བོ་དག་གིས་དེ་ལྟར་ཤེས་སོ།
en: “Yes, sister. People know me thus.”

source: །དེ་ནས་སྔོན་གྱི་བྲན་མོ་རྒན་མོ་དེ་རིངས་པ་རིངས་པར་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་གི་ཕ་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Then the old woman, his former slave, hurried to the venerable Rāṣṭrapāla’s father.

source: ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་གི་ཕ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཇོ་བོ་མཁྱེན་པར་མཛོད་ཅིག །སྲས་ཡུལ་འཁོར་སྐྱོང་བང་མཛོད་སྟུག་པོ་ཅན་དུ་བྱོན་ནས་རིང་མོ་ཞིག་ལགས་ན་ཉིད་ཀྱི་ཁབ་ཏུ་ནི་བྱོན་མི་བཞེད་དོ།
en: When she arrived, she said to him, “Sir, please be informed that your son Rāṣṭrapāla arrived in Sthūlakoṣṭhaka long before, but he would not enter his own home.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་གི་ཕས་ལག་པ་གཡོན་པས་སྐྲ་བསྡུས་ནས་རས་ཡུག་གཅིག་གི་སྨད་གཡོགས་བགོས་བཞིན་དུ་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་གང་ན་བ་དེར་སོང་བ་དང་། དེའི་ཚེ་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་རྩིག་དྲུང་ཞིག་ཏུ་འདུག་ནས་ཟན་དྲོན་རུལ་པ་ཞག་ལོན་པ་ཟ་བར་བྱེད་པ་དང་། དེ་ནས་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་གི་ཕས་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then the venerable Rāṣṭrapāla’s father, holding his hair with his left hand and wearing nothing but his loincloth, rushed to the venerable Rāṣṭrapāla. At that time the venerable Rāṣṭrapāla was sitting by the wall and eating the spoiled, day-old kulmāṣa.

source: །ཡུལ་འཁོར་སྐྱོང་ཁྱོད་བང་མཛོད་སྟུག་པོ་ཅན་དུ་ཕྱིན་ནས་རིང་མོ་ཞིག་ལོན་ན་ཅིའི་ཕྱིར་རང་གི་ཁྱིམ་དུ་འཇུག་པར་མི་འདོད།
en: Then the venerable Rāṣṭrapāla’s father asked him, “Rāṣṭrapāla, why do you not enter your own home despite having arrived in Sthūlakoṣṭhaka long before?

source: ཟན་དྲོན་རུལ་པ་ཞག་ལོན་པ་ཁྱོད་ཀྱི་གྲེ་བར་ཡང་ཇི་ལྟར་འགྲོར་བཏུབ།
en: Why are you eating that spoiled, day-old kulmāṣa?”

source: ཁྱིམ་བདག་ཁྱོད་ཀྱི་ཁྱིམ་དུ་འོངས་ན་རྒྱ་གག་མ་གཏོགས་པ་སྦྱིན་པ་ཡང་མ་ཐོབ། བསྐྲད་ཀྱང་མ་བསྐྲད་པ་དང་མྱུར་བ་མྱུར་བར་བྱུང་ངོ་།
en: “O householder, when I came to your house, I got no offering but abuse, and had to leave before I was chased away.”

source: །བུ་ཡུལ་འཁོར་སྐྱོང་ཡིན་པར་ཁོ་བོས་མི་ཤེས་མོད།
en: “I did not know it was my son Rāṣṭrapāla.

source: གལ་ཏེ ཁོ་བོས་ཤེས་ན་དེ་སྐད་མི་སྨྲ་བ་ཞིག །བུ་ཡུལ་འཁོར་སྐྱོང་བཟོད་པར་གསོལ་ལོ།
en: If I had known, I would not have said such a thing. My son Rāṣṭrapāla, forgive me.”

source: །ཁྱིམ་བདག་བཟོད་དོ།
en: “I forgive you, O householder.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་གི་ཕས་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་ལ་ཡན་ལག་ཐམས་ཅད་ཀྱིས་འཁྱུད་པ་བྱས་ནས་རང་གི་ཁྱིམ་དུ་སྟན་བཤམས་པ་ཉིད་ལ་འདུག་ཏུ་བཅུག་གོ།
en: Then the venerable Rāṣṭrapāla’s father firmly embraced him and had him sit on a seat prepared in his own home.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་གི་ཕས་ཡུལ་འཁོར་སྐྱོང་གི་མ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བུ་ཡུལ་འཁོར་སྐྱོང་ཡུན་རིང་ཞིག་ལོན་ནས་ཁྱིམ་དུ་འོངས་ཀྱིས།
en: The father then said to Rāṣṭrapāla’s mother, “Our son Rāṣṭrapāla has come back home after a long time.

source: ཀྱེ་རེ་ཞིག་ཁྱོད་བདག་ཉིད་ཀྱིས་སྣོད་དུ་ཚོས་ལ་སྟ་གོན་གྱིས་ཤིག་དང་དེ་ལ་བུ་ཡུལ་འཁོར་སྐྱོང་ལོངས་སྤྱོད་པར་འགྱུར་རོ།
en: Oh, cook and prepare a meal immediately. Our son Rāṣṭrapāla will eat it.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་གི་མས་རང་ཉིད་ཀྱིས་སྣོད་དུ་བཙོས་ནས་སྟ་གོན་བྱས་སོ།
en: The venerable Rāṣṭrapāla’s mother then cooked and prepared a meal herself.

source: །དེ་ནས་མི་ཞིག་གིས་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་གི་མདུན་དུ་གསེར་གྱི་ཕུང་པོ་ཆེན་པོ་གལ་ཏེ་མི་གཅིག་ཕ་རོལ་ན་འགྲེང་ན་མི་གཅིག་ཚུ་རོལ་ན་འདུག་པ་མི་མཐོང་ལ། མི་གཅིག་ཚུ་རོལ་ན་འདུག་ན་གཅིག་ཕ་རོལ་ན་འགྲེང་བ་མི་མཐོང་བ་སྤུངས་སོ།
en: Then a man piled pieces of gold in such a large heap that someone standing behind it could not see another standing before it, and someone standing before it could not see another standing behind it.

source: །ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་གི་མས་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བུ་ཡུལ་འཁོར་སྐྱོང་ཁྱོད་ཀྱི་མ་ལ་བུད་མེད་རྣམས་ཀྱི་བུད་མེད་ཀྱི་ནོར་དང་། བུད་མེད་ཀྱི་བག་རྫོངས་དང་། བུད་མེད་ཀྱི་ཁུད་པ་ཞེས་བྱ་བ་གང་ཡིན་པ་ཡང་འདི་སྙེད་ཅིག་ཡོད་དོ།
en: The venerable Rāṣṭrapāla’s mother said to him, “My son Rāṣṭrapāla, your mother has this amount of what is called dowry, dower, or marriage portion.

source: །གཞན་ཡང་ཁྱོད་ཀྱི་ཕའི་ནི་མཚན་མས་ཐེབས་པའི་གསེར་དང་ས་ལེ་སྦྲམ་ཡང་བརྒྱ་ཕྲག་དུ་མ་དང་། སྟོང་ཕྲག་དུ་མ་དང་། བརྒྱ་སྟོང་ཕྲག་དུ་མ་ཡོད་ན་ཕལ་གཞན་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: Your father has also accumulated gold—and hundreds, thousands, hundreds of thousands of fine grains of gold—not to mention other things.

source: བུ་ཡུལ་འཁོར་སྐྱོང་ཚུར་ཁྱོད་འདུག་ལ་འདོད་པ་དག་ལ་ཡང་ཡོངས་སུ་སྤྱོད་ཅིག །སྦྱིན་པ་དག་ཀྱང་ཐོང་ཤིག །བསོད་ནམས་དག་ཀྱང་གྱིས་ཤིག །ཁྱིམ་བདག་གི་ཆུང་མ་ཁྱོད་གལ་ཏེ་ཁོ་བོའི་ཚིག་ལ་དད་པས་མཉན་པར་བྱ་བར་སེམས་པ་ལྟ་ན།
en: My son Rāṣṭrapāla, now stay here and enjoy the objects of desire, give donations, and make merit.” “O householder’s wife, if you will listen to my words with faith, I will instruct and teach you.”

source: བདག་གིས་གདམས་ཤིང་རྗེས་སུ་བསྟན་ཏོ།
en: “My son Rāṣṭrapāla, instruct me.

source: །བུ་ཡུལ་འཁོར་སྐྱོང་གདམས་ངག་སྩོལ་ཅིག །བུ་ཡུལ་འཁོར་སྐྱོང་རྗེས་སུ་སྟོན་ཅིག་དང་། ཁྱོད་ཀྱི་ཚིག་ལ་བདག་དད་པས་མཉན་པར་བགྱིའོ་སྙམ་དུ་སེམས་སོ།
en: My son Rāṣṭrapāla, teach me. I will listen to your words with faith.”
